{
  "birth": [
    {
      "name": "Diana Tai",
      "role": "my mother",
      "description": "thank you for teaching me the importance of honesty and always bringing a contagious excitement to every movie we watch",
      "icon": "heart"
    },
    {
      "name": "Jerry Hsiao",
      "role": "my dad",
      "description": "thank you for demonstrating the importance of apologizing and showing me the beauty of nature"
    },
    {
      "name": "Jeriann Hsiao",
      "role": "my sister",
      "description": "thank you for setting such an excellent example for me in school, piano, and life! you unironically are the best sister"
    }
  ],
  "elementary school": [
    {
      "name": "Norah Langton",
      "role": "piano teacher",
      "description": "thank you for introducing me to the world of piano - it has become such an integral part of who I am today",
      "icon": "music"
    },
    {
      "name": "Linda Penrice",
      "role": "first grade teacher",
      "description": "thank you for welcoming me to elementary school a year early and laying the foundation for my public speaking skills",
      "icon": "pencil"
    },
    {
      "name": "Amy Hall",
      "role": "piano teacher",
      "description": "thank you for encouraging me to continue learning music and showing me how I can use these talents in worship",
      "icon": "piano"
    },
    {
      "name": "Caleb Mulder",
      "role": "my friend",
      "description": "thank you for being the best workout buddy and inspiring me to be courageous in my faith",
      "icon": "dumbbell"
    },
    {
      "name": "Paul Chen",
      "role": "my friend",
      "description": "thank you for exhibiting how important it is to bring a seemingly-infinite amount of enthusiasm to anything I lead",
      "icon": "lightning"
    },
    {
      "name": "Elliot Pai",
      "role": "my cousin",
      "description": "thank you for being as close to a brother that I could have - I owe a lot of my sillyness to you!",
      "icon": "smile"
    },
    {
      "name": "Jeremy Kuikman",
      "role": "sixth grade teacher",
      "description": "thank you for igniting my love for math (and dodgeball)",
      "icon": "apple"
    },
    {
      "name": "Terry Ciona",
      "role": "my pastor",
      "description": "thank you for leading the church with authenticity and always encouraging us to give back to the community"
    }
  ],
  "high school": [
    {
      "name": "Matt Bunch",
      "role": "youth group leader",
      "description": "thank you for helping me overcome my fear of rollercoasters"
    },
    {
      "name": "Brenda Csordas",
      "role": "biology teacher",
      "description": "thank you for having such a contagious passion for biology and dedicating so much of your time to helping me prepare for university",
      "icon": "leaf"
    },
    {
      "name": "Brian Garcia",
      "role": "math teacher",
      "description": "thank you for providing me with the advice and environment to grow my love for chess",
      "icon": "pawn"
    },
    {
      "name": "Michael D'Agostino",
      "role": "chemistry teacher",
      "description": "thank you for using your incredible intelligence to very patiently teach us about chemistry",
      "icon": "beaker"
    },
    {
      "name": "Nolan Cross",
      "role": "my friend",
      "description": "thank you for demonstrating what a true passion and appreciation for music and the piano looks like"
    },
    {
      "name": "David McCreary",
      "role": "graphic design teacher",
      "description": "thank you for introducing me to the world of graphic design - without it I would have never discovered my passion for UX/UI design!",
      "icon": "cursor"
    },
    {
      "name": "Naomi Wratten",
      "role": "piano teacher",
      "description": "thank you for providing me with the community and opportunities to push my limits as a pianist"
    },
    {
      "name": "Graham Brown",
      "role": "math teacher",
      "description": "thank you for extending my passion for math beyond the classroom - after all, there are no equations to travel to the moon"
    },
    {
      "name": "Max Archer",
      "role": "my friend",
      "description": "thank you for inspiring me to improve how I articulate my arguments and thoughts"
    },
    {
      "name": "Nicole Pugh",
      "role": "my friend",
      "description": "thank you for just radiating kindness and wisdom in every situation"
    },
    {
      "name": "David Dean",
      "role": "student trustee mentor",
      "description": "thank you for guiding me through my responsibilities as a student trustee and patiently supporting me in my campaigns for student wellbeing",
      "icon": "pen"
    },
    {
      "name": "Danielle Curtis",
      "role": "photography teacher",
      "description": "thank you for stretching my photography and creativity to limits that I would have never imagined",
      "icon": "camera"
    }
  ],
  "university": [
    {
      "name": "David Mahn",
      "role": "family friend",
      "description": "thank you for helping me create my first resume and just being an all-around cool guy",
      "icon": "lightbulb"
    },
    {
      "name": "Aaron Dyck",
      "role": "my friend",
      "description": "thank you for always being calm no matter the situation - I'm so glad that you were the first person that I met in uni!"
    },
    {
      "name": "David Ryu",
      "role": "fellowship leader",
      "description": "thank you for reviving my faith outside of its lukewarmness and challenging me to boldly pursue Christ"
    },
    {
      "name": "Dasol Lee",
      "role": "my friend",
      "description": "thank you for making me feel welcome at Kingdom Come!"
    },
    {
      "name": "Emily Louie",
      "role": "my friend",
      "description": "thank you for supporting me as we walked through mentorships, designathons, building our first portfolios, and our first co-op together!"
    },
    {
      "name": "Daniel Kwon",
      "role": "program mentor",
      "description": "thank you for providing me with invaluable resume advice and guiding me through my first co-op application season",
      "icon": "laptop"
    },
    {
      "name": "Judy Zhong",
      "role": "program mentor",
      "description": "thank you for inspiring me to pursue product design and coaching me through design interview questions",
      "icon": "speech"
    },
    {
      "name": "Michael Shiozaki",
      "role": "program mentor",
      "description": "thank you for welcoming me to my first year of university acapella!"
    },
    {
      "name": "Andrew Chow",
      "role": "my friend",
      "description": "thank you for encouraging me through my first year of university and allowing me to honestly share my burdens"
    },
    {
      "name": "Vevina Trinh",
      "role": "tech+ mentor",
      "description": "thank you for guiding me through the portfolio ideation, design, and development process"
    },
    {
      "name": "Xiaopu Fung",
      "role": "lab leader",
      "description": "thank you for taking a chance on me, showing me how rewarding public service can be, and demonstrating how to promote diversity from a leadership role"
    },
    {
      "name": "Lukas Rossi",
      "role": "my friend",
      "description": "thank you for helping me develop my first portfolio and being the first example of a Christian in the tech industry that I have met!"
    },
    {
      "name": "James Kelly",
      "role": "faithtech founder",
      "description": "thank you for creating an outlet for so many Christians to use their skills to further God's Kingdom",
      "icon": "cross"
    },
    {
      "name": "Ken Ives",
      "role": "acapella group leader",
      "description": "thank you for building a supportive community where people can develop their vocal skills together",
      "icon": "microphone"
    },
    {
      "name": "Joe Dara",
      "role": "echo compassion designer",
      "description": "thank you for openly exchanging design advice with me throughout the design-to-dev implementation of the platform"
    },
    {
      "name": "Magdalene Lee",
      "role": "echo compassion dev",
      "description": "thank you for patiently teaching me front-end development and Git hygiene"
    },
    {
      "name": "Igor Ivkovic",
      "role": "circuitry professor",
      "description": "thank you for fascinating me with the intricacies of computer architecture and caring so much for your students both inside and outside of the classroom"
    },
    {
      "name": "Shi Cao",
      "role": "algorithms professor",
      "description": "thank you for blending interactivity and art into your lectures"
    },
    {
      "name": "Sharon Zheng",
      "role": "tech+ mentor",
      "description": "thank you for inspiring me to integrate my love for design and development into my passion projects"
    }
  ]
}
